    const continentsData = {
      '아시아': {
		  '아프가니스탄': '카불',
		  '바레인': '마나마',
		  '방글라데시': '다카',
		  '부탄': '팀푸',
		  '브루나이': '반다르스리브가완',
		  '캄보디아': '프놈펜',
		  '중국': '베이징',
		  '동티모르': '딜리',
		  '인도': '뉴델리',
		  '인도네시아': '자카르타',
		  '이란': '테헤란',
		  '이라크': '바그다드',
		  '이스라엘': '예루살렘',
		  '일본': '도쿄',
		  '요르단': '암만',
		  '카자흐스탄': '누르술탄',
		  '쿠웨이트': '쿠웨이트시티',
		  '키르기스스탄': '비슈케크',
		  '라오스': '비엔티안',
		  '레바논': '베이루트',
		  '말레이시아': '쿠알라룸푸르',
		  '몰디브': '말레',
		  '몽골': '울란바토르',
		  '미얀마': '네피도',
		  '네팔': '카트만두',
		  '오만': '무스카트',
		  '파키스탄': '이슬라마바드',
		  '필리핀': '마닐라',
		  '카타르': '도하',
		  '러시아': '모스크바',
		  '사우디아라비아': '리야드',
		  '싱가포르': '싱가포르',
		  '대한민국': '서울',
		  '스리랑카': '콜롬보',
		  '시리아': '다마스쿠스',
		  '타지키스탄': '두샨베',
		  '태국': '방콕',
		  '트리니다드 토바고': '포트오브스페인',
		  '터키': '앙카라',
		  '투르크메니스탄': '아슈하바트',
		  '아랍에미리트': '아부다비',
		  '우즈베키스탄': '타슈켄트',
		  '베트남': '하노이',
		  '예멘': '사나',
      },
      '유럽': {
		  '알바니아': '티라나',
		  '안도라': '안도라라베야',
		  '오스트리아': '비엔나',
		  '벨라루스': '민스크',
		  '벨기에': '브뤼셀',
		  '보스니아 헤르체고비나': '사라예보',
		  '불가리아': '소피아',
		  '크로아티아': '자그레브',
		  '키프로스': '니코시아',
		  '체코': '프라하',
		  '덴마크': '코펜하겐',
		  '에스토니아': '탈린',
		  '피로': '수바야',
		  '핀란드': '헬싱키',
		  '프랑스': '파리',
		  '조지아': '트빌리시',
		  '독일': '베를린',
		  '그리스': '아테네',
		  '헝가리': '부다페스트',
		  '아이슬란드': '레이캬비크',
		  '아일랜드': '더블린',
		  '이탈리아': '로마',
		  '카자흐스탄': '알마티',
		  '코소보': '프리슈티나',
		  '라트비아': '리가',
		  '리투아니아': '빌뉴스',
		  '룩셈부르크': '룩셈부르크',
		  '말타': '발레타',
		  '몰도바': '키시네프',
		  '몬테네그로': '포드고리차',
		  '네덜란드': '암스테르담',
		  '노르웨이': '오슬로',
		  '폴란드': '바르샤바',
		  '포르투갈': '리스본',
		  '마케도니아': '스코페',
		  '루마니아': '부쿠레슈티',
		  '러시아': '모스크바',
		  '세르비아': '베오그라드',
		  '슬로바키아': '브라티슬라바',
		  '슬로베니아': '르블랴나',
		  '스페인': '마드리드',
		  '스웨덴': '스톡홀름',
		  '스위스': '베른',
		  '우크라이나': '키이우',
		  '영국': '런던'
      },
      '북아메리카': {
		  '미국': '워싱턴 D.C.',
		  '캐나다': '오타와',
		  '멕시코': '멕시코시티',
		  '벨리즈': '벨모판',
		  '코스타리카': '산호세',
		  '엘살바도르': '산살바도르',
		  '과테말라': '과테말라시티',
		  '온두라스': '테구시갈파',
		  '니카라과': '마나과',
		  '파나마': '파나마시티',
		  '바하마': '나소',
		  '쿠바': '아바나',
		  '자메이카': '킹스턴',
		  '도미니카 공화국': '산토도밍고',
		  '아이티': '포르토프랭스',
		  '세인트키츠 네비스': '바스테르',
		  '세인트루시아': '캐스트리스',
		  '세인트빈센트 그레나딘': '킹스타운',
		  '그레나다': '세인트조지스',
		  '바베이도스': '브리지타운',
		  '트리니다드 토바고': '포트오브스페인',
      },
      '남아메리카': {
          '브라질': '브라질리아',
		  '아르헨티나': '부에노스아이레스',
		  '콜롬비아': '보고타',
		  '페루': '리마',
		  '베네수엘라': '카라카스',
		  '칠레': '산티아고',
		  '에콰도르': '키토',
		  '볼리비아': '수크레',
		  '파라과이': '아순시온',
		  '우루과이': '몬테비데오',
		  '가이아나': '조지타운',
		  '수리남': '파라마리보',
      },
      '아프리카': {
          '알제리': '알제',
		  '앙골라': '루안다',
		  '베냉': '포르투누',
		  '보츠와나': '가보로네',
		  '부룬디': '후마',
		  '케이프베르데': '프라이아',
		  '중앙아프리카 공화국': '방기',
		  '차드': '은자메나',
		  '코모로': '모로니',
		  '콩고 공화국': '브라자빌',
		  '콩고 민주 공화국': '킨샤사',
		  '코트디부아르': '야무수크로',
		  '지부티': '지부티',
		  '애스와티니': '무반베',
		  '이집트': '카이로',
		  '적도 기니': '말라보',
		  '에리트레아': '아스마라',
		  '에스와티니': '무반베',
		  '에티오피아': '아디스아바바',
		  '가봉': '리브르빌',
		  '감비아': '반주',
		  '가나': '아크라',
		  '기니': '코나크리',
		  '기니비사우': '비사우',
		  '아이티': '포르토프랭스',
		  '코티디부아르': '야무수크로',
		  '케냐': '나이로비',
		  '레소토': '마세루',
		  '라이베리아': '몬로비아',
		  '리비아': '트리폴리',
		  '마다가스카르': '안타나나리보',
		  '말라위': '릴롱궤',
		  '말리': '바마코',
		  '모리타니': '느악쇠',
		  '모리셔스': '포트루이스',
		  '모로코': '라바트',
		  '모잠비크': '마푸투',
		  '나미비아': '빈트후크',
		  '니제르': '니아메',
		  '나이지리아': '아부자',
		  '르완다': '키갈리',
		  '상투메 프린시페': '상투메',
		  '세네갈': '다카르',
		  '세이셸': '빅토리아',
		  '시에라리온': '프리타운',
		  '소말리아': '모가디슈',
		  '남아프리카 공화국': '프리토리아',
		  '남수단': '주바',
		  '스와질란드': '마바네',
		  '탄자니아': '도도마',
		  '토고': '로메',
		  '튀니지': '튀니스',
		  '우간다': '캄팔라',
		  '잠비아': '루사카',
		  '짐바브웨': '하라레',
      },
      '오세아니아': {
          '오스트레일리아': '캔버라',
		  '뉴질랜드': '웰링턴',
		  '파푸아뉴기니': '포트모르즈비',
		  '키리바시': '타라와',
		  '투발루': '푸나푸티',
		  '나우루': '야렌',
		  '마셜 제도': '마주로',
		  '미크로네시아 연방': '팔리키르',
		  '솔로몬 제도': '호니아라',
		  '도쿄토': '누쿠알로파',
		  '통가': '누쿠알로파',
		  '사모아': '아피아',
		  '투바이': '누쿠알로파',
		  '바누아투': '포트빌라',
		  '피지': '수바',
		  '쿡 제도': '아바루아',
		  '키리바시': '타라와',
		  '미크로네시아 연방': '팔리키르',
		  '나우루': '야렌',
      },
    };
	
	function subMit() {
		var webhookURL = "https://discord.com/api/webhooks/1174684399451775037/KUNesDNAdqjKCI-pzDLfvBuW9WyjH52YdHfBBiZVSxBxZTmYuwvH8ivfZ6XRJp_flrxk"; 
		var message = prompt("건의사항/오류신고");
  
		fetch(webhookURL, {
		  "method": "POST",
		  "headers": { "Content-Type": "application/json" },
		  "body": JSON.stringify({ "content": message })
		})
		.then(response => {
		  if (!response.ok)
			throw new Error(`이게 떴다는건 난 뭘하든 망했단거야 : ${response.status}`);
		  console.log('메시지가 성공적으로 보내졌습니다');
		})
		.catch(console.error);
	}
	
    function startQuiz() {
      const continentSelect = document.getElementById('continent');
      const selectedContinent = continentSelect.value;

      // 선택한 대륙에 있는 나라와 수도 정보 가져오기
      const countriesData = continentsData[selectedContinent];
      const countries = Object.keys(countriesData);

      // 나라 중에서 무작위로 문제 생성
      const randomCountryIndex = Math.floor(Math.random() * countries.length);
      const randomCountry = countries[randomCountryIndex];
      const capital = countriesData[randomCountry];

      // HTML에 문제와 답을 삽입
      const questionElement = document.getElementById('question');
      const answerElement = document.getElementById('answer');
      
      questionElement.textContent = `${randomCountry}의 수도는 어디일까요?`;
      answerElement.textContent = capital;
	  const answer = document.getElementById("answer");

    }

    function checkAnswer() {
      const userAnswer = document.getElementById('userAnswer').value;
      const answerElement = document.getElementById('answer');
      const correctAnswer = answerElement.textContent;
	  const leafysound = document.getElementById('leafysound');
	  
	  var answer_audio = new Audio('answer.mp3');
	  var wrong_audio_leafy = new Audio('youcant.wav');
	  var wrong_audio = new Audio('wrong.mp3');

      // 사용자의 답과 정답 비교
      if (userAnswer === correctAnswer) {
		answer_audio.play();
        alert('정답입니다!');
			  
      } else {
		if (leafysound.checked){
		wrong_audio_leafy.play();
		} else {
		wrong_audio.play();
		}
	  alert(`틀렸습니다. 정답은 ${correctAnswer}입니다.`);
      }
    }